In [8]:
# numpy 사용
import numpy as np

In [7]:
# random 사용
import random

In [4]:
random.randint(1,3)

2

In [9]:
# datetime 사용
from datetime import datetime

In [6]:
today = datetime.now()
print(today)

2024-03-05 09:23:13.005184

In [10]:
datetime.strftime(today,'%Y/%m/%d %H:%M:%S')

'2024/03/05 09:23:13'

In [11]:
dt = datetime(2024,2,1)

In [12]:
print(dt.year)
print(dt.month)
print(dt.day)

2024
2
1

In [13]:
print(dt.date())

2024-02-01

In [14]:
dt.weekday()

3

In [16]:
# calendar 모듈 사용
import calendar

In [17]:
calendar.day_name[0]

'Monday'

In [18]:
monthInfo = calendar.monthrange(2024,2)
print(monthInfo)

(3, 29)

In [20]:
# pandas 사용
import pandas as pd

In [21]:
a = np.array([1,2,3])

In [22]:
b = np.array([[1,2,3],[4,5,6]])

In [23]:
print(a.shape)
print(b.shape)
print(b[0])

(3,)
(2, 3)
[1 2 3]

In [31]:
gisa = pd.read_csv('Abc1115.csv')

In [26]:
gisa.columns

Index(['990001', 'addx', ' 17', ' 29', ' 16', ' 49', ' 43', '154', 'C', 'A',
       'C.1'],
      dtype='object')

In [28]:
gisa.describe()

,990001,17,29,16,49,43,154
count,999.000000,999.000000,999.000000,999.000000,999.000000,999.000000,999.000000
mean,990501.000000,50.059059,49.563564,50.954955,51.277277,50.922923,252.777778
std,288.530761,28.493988,29.053949,29.281971,28.784985,28.447594,65.156930
min,990002.000000,1.000000,1.000000,1.000000,1.000000,1.000000,67.000000
25%,990251.500000,26.000000,25.000000,25.000000,26.000000,25.000000,207.000000
50%,990501.000000,48.000000,49.000000,50.000000,52.000000,52.000000,251.000000
75%,990750.500000,75.000000,74.000000,76.000000,76.000000,75.000000,298.000000
max,991000.000000,100.000000,100.000000,100.000000,100.000000,100.000000,434.000000

In [32]:
gisa.head(10)

   990001  addx   17   29   16   49   43  154  C  A C.1
0  990002  stch   30    9   48   25   81  193  C  A   A
1  990003  gali   93   60    6   84   36  279  A  C   A
2  990004  miat   73   22   48   24   72  239  B  C   C
3  990005  oran   33   38   59   58   28  216  C  B   A
4  990006  sj24   27   65   54   77   33  256  B  A   A
5  990007  kor2   33   85   98   60   66  342  A  B   A
6  990008  vsky   41    5   99   14   67  226  C  A   C
7  990009  kimd   74    4    1   33   53  165  B  C   A
8  990010  blue   55   84   50   89   37  315  A  B   A
9  990011  moja   43   69   68   23   92  295  B  A   C

In [34]:
gisa.columns = ['stdNo','email','kor','eng','math','sci','hist','total','mgrCode','accCode','locCode']

In [35]:
gisa.head(10)

    stdNo email  kor  eng  math  sci  hist  total mgrCode accCode locCode
0  990002  stch   30    9    48   25    81    193       C       A       A
1  990003  gali   93   60     6   84    36    279       A       C       A
2  990004  miat   73   22    48   24    72    239       B       C       C
3  990005  oran   33   38    59   58    28    216       C       B       A
4  990006  sj24   27   65    54   77    33    256       B       A       A
5  990007  kor2   33   85    98   60    66    342       A       B       A
6  990008  vsky   41    5    99   14    67    226       C       A       C
7  990009  kimd   74    4     1   33    53    165       B       C       A
8  990010  blue   55   84    50   89    37    315       A       B       A
9  990011  moja   43   69    68   23    92    295       B       A       C

In [37]:
gisa[['kor','eng','math']].head()

   kor  eng  math
0   30    9    48
1   93   60     6
2   73   22    48
3   33   38    59
4   27   65    54

In [38]:
gisa.tail()

      stdNo email  kor  eng  math  sci  hist  total mgrCode accCode locCode
994  990996  seok   43   35    77   34    39    228       A       B       B
995  990997  smj2    3   59    28   53    23    166       A       C       B
996  990998  kcdp   34   46    95   37    11    223       B       A       A
997  990999  banj   12   36    10   62    28    148       C       A       C
998  991000  ccor   64   53    22   36    54    229       B       C       C

In [39]:
gisa[gisa['total']>=400]

      stdNo email  kor  eng  math  sci  hist  total mgrCode accCode locCode
37   990039  huff   52   99    97   87    72    407       A       C       A
49   990051  soor   94   98    85   64    75    416       A       B       A
362  990364  ywjs   88   81   100   84    81    434       B       C       A
420  990422  itkz   93   97    74   69    80    413       C       B       B
657  990659  pete  100   98    77   44    85    404       B       C       C
751  990753  firs   82   58    93   86    83    402       A       C       B

In [40]:
gisa.groupby('mgrCode').total.std()

mgrCode
A    66.683729
B    66.060773
C    62.800499
Name: total, dtype: float64